Revit 2026 API

# GraphicsStyleType Enumeration

---

Describes the type of graphics style.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public enum GraphicsStyleType
```
```vb
Public Enumeration GraphicsStyleType
```
```cpp
public enum class GraphicsStyleType
```
```fsharp
type GraphicsStyleType
```

| Member name | Value | Description |
| --- | --- | --- |
| Cut | 2 | Cut. |
| Projection | 1 | Projection. |

#### Reference

Autodesk.Revit.DB Namespace